app/Controllers/Prosedur.php

SELECT *
FROM `prosedur`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `prosedur`
---
    public function index($id=0)
    {
        $promod =  new ProsedurModel();
        $kunci = $this->request->getVar('cari');

        if ($kunci) {
            $query = $promod->pencarian($kunci);
            $jumlah = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $promod;
            $jumlah = " ";
        }

        $page = $this->request->getGet('p');
        $page = isset($page)?$page:1;
        $offset = ($page-1) * 5;

        $data = [
            'title' => 'Data Prosedur',
            'promod' => $promod->paginate(5),